# -*- coding: utf-8 -*-

# 基于机器视觉的人脸表情识别系统设计-汪哲文毕业设计
#
# data.py
# 本文件为数据层，负责存储底层数据常量和模型文件
#
# 最后更新时间 2024/04/15

from enum import Enum
from cv2 import CascadeClassifier
from keras.models import load_model
from PIL import ImageFont

# 人脸识别和表情识别的模型路径
MODEL_FACE = 'models/model_face/haarcascade_frontalface_default.xml'
MODEL_EMOTION = 'models/model_emotion/fer2013_mini_XCEPTION.33-0.65.hdf5'
# 载入模型数据
CLASSIFIER_FACE = CascadeClassifier(MODEL_FACE)
CLASSIFIER_EMOTION = load_model(MODEL_EMOTION, compile=False)
CLASSIFIER_EMOTION_SIZE = CLASSIFIER_EMOTION.input_shape[1:3]  # type: ignore

# 识别器的种类
RECOGNIZER_TYPE = {'image': 0, 'vidio': 1, 'camera': 2}

# 表情的标签划分
EMOTION_LABELS = {
    0: '愤怒',
    1: '厌恶',
    2: '恐惧',
    3: '快乐',
    4: '悲伤',
    5: '惊讶',
    6: '平静'
}

# 微表情划分表
EMOTION_MICRO_LABELS = {
    (0, ): '{0}({1}%)',
    (1, ): '{0}({1}%)',
    (2, ): '{0}({1}%)',
    (3, ): '{0}({1}%)',
    (4, ): '{0}({1}%)',
    (5, ): '{0}({1}%)',
    (6, ): '{0}({1}%)',
    (0, 1): '憎恨({0}/{1} {2}%)',
    (0, 2): '紧张({0}/{1} {2}%)',
    (0, 3): '挑衅({0}/{1} {2}%)',
    (0, 4): '沮丧({0}/{1} {2}%)',
    (0, 5): '震惊({0}/{1} {2}%)',
    (0, 6): '冷漠({0}/{1} {2}%)',
    (1, 2): '疑虑({0}/{1} {2}%)',
    (1, 3): '反常({0}/{1} {2}%)',
    (1, 4): '绝望({0}/{1} {2}%)',
    (1, 5): '复杂({0}/{1} {2}%)',
    (1, 6): '无聊({0}/{1} {2}%)',
    (2, 3): '反常({0}/{1} {2}%)',
    (2, 4): '复杂({0}/{1} {2}%)',
    (2, 5): '复杂({0}/{1} {2}%)',
    (2, 6): '疑虑({0}/{1} {2}%)',
    (3, 4): '矛盾({0}/{1} {2}%)',
    (3, 5): '惊喜({0}/{1} {2}%)',
    (3, 6): '满足({0}/{1} {2}%)',
    (4, 5): '震惊({0}/{1} {2}%)',
    (4, 6): '失望({0}/{1} {2}%)',
    (5, 6): '矛盾({0}/{1} {2}%)',
    (0, 1, 2): '复杂({0}/{1}/{2} {3}%)',
    (0, 1, 3): '嘲笑({0}/{1}/{2} {3}%)',
    (0, 1, 4): '失望({0}/{1}/{2} {3}%)',
    (0, 1, 5): '复杂({0}/{1}/{2} {3}%)',
    (0, 1, 6): '冷酷({0}/{1}/{2} {3}%)',
    (0, 2, 3): '反常({0}/{1}/{2} {3}%)',
    (0, 2, 4): '复杂({0}/{1}/{2} {3}%)',
    (0, 2, 5): '复杂({0}/{1}/{2} {3}%)',
    (0, 2, 6): '焦虑({0}/{1}/{2} {3}%)',
    (0, 3, 4): '矛盾({0}/{1}/{2} {3}%)',
    (0, 3, 5): '激动({0}/{1}/{2} {3}%)',
    (0, 3, 6): '挑衅({0}/{1}/{2} {3}%)',
    (0, 4, 5): '悲愤({0}/{1}/{2} {3}%)',
    (0, 4, 6): '失望({0}/{1}/{2} {3}%)',
    (0, 5, 6): '矛盾({0}/{1}/{2} {3}%)',
    (1, 2, 3): '反常({0}/{1}/{2} {3}%)',
    (1, 2, 4): '绝望({0}/{1}/{2} {3}%)',
    (1, 2, 5): '复杂({0}/{1}/{2} {3}%)',
    (1, 2, 6): '疑虑({0}/{1}/{2} {3}%)',
    (1, 3, 4): '矛盾({0}/{1}/{2} {3}%)',
    (1, 3, 5): '反常({0}/{1}/{2} {3}%)',
    (1, 3, 6): '挑衅({0}/{1}/{2} {3}%)',
    (1, 4, 5): '悲愤({0}/{1}/{2} {3}%)',
    (1, 4, 6): '失望({0}/{1}/{2} {3}%)',
    (1, 5, 6): '矛盾({0}/{1}/{2} {3}%)',
    (2, 3, 4): '矛盾({0}/{1}/{2} {3}%)',
    (2, 3, 5): '不安({0}/{1}/{2} {3}%)',
    (2, 3, 6): '反常({0}/{1}/{2} {3}%)',
    (2, 4, 5): '复杂({0}/{1}/{2} {3}%)',
    (2, 4, 6): '复杂({0}/{1}/{2} {3}%)',
    (2, 5, 6): '矛盾({0}/{1}/{2} {3}%)',
    (3, 4, 5): '矛盾({0}/{1}/{2} {3}%)',
    (3, 4, 6): '矛盾({0}/{1}/{2} {3}%)',
    (3, 5, 6): '惊喜({0}/{1}/{2} {3}%)',
    (4, 5, 6): '矛盾({0}/{1}/{2} {3}%)',
}

# 表情映射表
EMOTION_MAP = (
    lambda x: round(184 * x**3 - 408 * x**2 + 324 * x),
    lambda x: round(100 * x**0.25),
    lambda x: round(32 * x**3 - 153 * x**2 + 221 * x),
    lambda x: round(162 * x**3 - 105 * x**2 + 43 * x),
    lambda x: round(128 * x**3 - 344 * x**2 + 316 * x),
    lambda x: round(179 * x**3 - 400 * x**2 + 321 * x),
    lambda x: round(100 * x**0.5),
)


# 识别结果的提示词
class Result(Enum):
    PREPARE = '模型已载入'
    FINISH = '识别完成'
    CONTINUE = '检测中'
    NO_FILE_SELECTED = '未选择文件'
    LOADING = '请等待...'
    FILE_NOT_FOUND = '找不到文件'
    CAMERA_NOT_FOUND = '找不到摄像头'
    CAMERA_START = '摄像头已启动'
    FACE_NOT_FOUND = '找不到人脸'
    FACE_NOT_FOUND_CONTINUE = '检测中...'
    FACE_FOUND_SINGLE = '检测到人脸，识别结果为：'
    FACE_FOUND_MULTIPLE = '检测到 {0} 张人脸，识别结果为：\n'


# 图像路径
PATH_ORIGIN = 'temp/origin.png'
PATH_RESULT = 'temp/result.png'

# 字体路径
FONT = ImageFont.truetype('temp/msyh.ttc', 24)
