clc;
clear;
close all;
% 快乐：嘴角上扬状
% 0.8-0.99
x = [0, 0.4, 0.8, 0.95, 1]; % 输入已知的 x 坐标
y = [0, 10, 50, 80, 100]; % 输入已知的 y 坐标
p = polyfit(x, y, 3);
% 愤怒：咬牙切齿挤眼睛状
% 0.2-0.45
x = [0, 0.2, 0.45, 1]; % 输入已知的 x 坐标
y = [0, 50, 80, 100]; % 输入已知的 y 坐标
p = polyfit(x, y, 3);
% 恐惧：挑高眉毛闭嘴状
% 0.3-0.5
x = [0, 0.3, 0.5, 0.75, 1]; % 输入已知的 x 坐标
y = [0, 50, 80, 90, 100]; % 输入已知的 y 坐标
p = polyfit(x, y, 3);
% 惊讶：大张嘴状
% 0.2-0.6
x = [0, 0.2, 0.6, 0.61, 1]; % 输入已知的 x 坐标
y = [0, 50, 80, 95, 100]; % 输入已知的 y 坐标
p = polyfit(x, y, 3);
% 悲伤：嘴角下压状
% 0.2-0.4
x = [0, 0.2, 0.4, 0.8, 1]; % 输入已知的 x 坐标
y = [0, 50, 80, 98, 100]; % 输入已知的 y 坐标
p = polyfit(x, y, 3);
% 厌恶：挤眼睛嘴角下压状
% 0.02-0.05
% 平静：无表情状
% 0.3+




xx = linspace(min(x), max(x), 100);
yy = polyval(p, xx);
plot(x, y, 'o', xx, yy, '-');
grid on;
disp('拟合多项式解析式:');
disp(p);


